In [1]:
import pandas as pd

In [2]:
!cat lec25.csv

q,r,s,t,apple
2,3,4,5,pear
a,s,d,f,rabbit
5,2,5,7,dog

In [3]:
dframe = pd.read_csv("lec25.csv")

In [4]:
dframe

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [5]:
dframe = pd.read_csv("lec25.csv", header=None)

In [6]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [8]:
dframe = pd.read_table("lec25.csv", sep=",", header=None)

In [9]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [11]:
pd.read_csv("lec25.csv", header=None, nrows=2)

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [12]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [13]:
dframe.to_csv("mytextdata_out.csv")

In [14]:
!cat mytextdata_out.csv

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [15]:
import sys

In [16]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [24]:
dframe.to_csv(sys.stdout, sep="_")

_0_1_2_3_4
0_q_r_s_t_apple
1_2_3_4_5_pear
2_a_s_d_f_rabbit
3_5_2_5_7_dog

In [28]:
dframe.to_csv(sys.stdout, sep="\t")

	0	1	2	3	4
0	q	r	s	t	apple
1	2	3	4	5	pear
2	a	s	d	f	rabbit
3	5	2	5	7	dog

In [29]:
dframe.to_csv(sys.stdout, columns=[0,1,2])

,0,1,2
0,q,r,s
1,2,3,4
2,a,s,d
3,5,2,5

In [30]:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [31]:
import json

In [32]:
data = json.loads(json_obj)

In [33]:
data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [34]:
type(data)

dict

In [36]:
data["diet"]

[{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]

In [37]:
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [38]:
json.dump(data, open("data.json", "w"))

In [39]:
!cat data.json

{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}

In [40]:
json.load(open("data.json"))

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [41]:
 url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

In [42]:
dframe_list = pd.io.html.read_html(url)

In [44]:
dframe = dframe_list[0]

In [45]:
dframe

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [46]:
dframe.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')

In [51]:
dframe = pd.read_excel("Lec_28_test.xlsx", sheet_name="Sheet1")

In [52]:
dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365

In [53]:
import numpy as np
from pandas import DataFrame

In [56]:
dframe1 = DataFrame({"key":["X", "Z", "Y", "Z", "X", "X"],
                   "data_set_1":np.arange(6)})

In [57]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [59]:
dframe2 = DataFrame({"key":["Q","Y","Z"], "data_set_2":[1,2,3]})

In [60]:
dframe2

  key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [61]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [62]:
pd.merge(dframe1,dframe2, on="key")

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [63]:
pd.merge(dframe1, dframe2, on="key", how="left")

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         3.0
2   Y           2         2.0
3   Z           3         3.0
4   X           4         NaN
5   X           5         NaN

In [64]:
pd.merge(dframe1, dframe2, on="key", how="right")

  key  data_set_1  data_set_2
0   Z         1.0           3
1   Z         3.0           3
2   Y         2.0           2
3   Q         NaN           1

In [65]:
pd.merge(dframe1, dframe2, on="key", how="outer")

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         3.0
4   Z         3.0         3.0
5   Y         2.0         2.0
6   Q         NaN         1.0

In [67]:
dframe3 = DataFrame({"key": ["X","X","X","Y","Z","Z"],
                    "data_set_3": range(6)})

In [72]:
dframe4 = DataFrame({"key": ["Y","Y","X","X","Z"],
                    "data_set_4": range(5)})

In [69]:
dframe3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [70]:
dframe4

  key  data_set_3
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

In [73]:
pd.merge(dframe3, dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [75]:
df_right = DataFrame({"key1":["SF","SF","LA","LA"],
                    "key2": ["one", "one", "one", "two"],
                    "left_data":[40,50,60,70]})

In [76]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [77]:
df_right

  key1 key2  left_data
0   SF  one         40
1   SF  one         50
2   LA  one         60
3   LA  two         70

In [78]:
pd.merge(df_left, df_right, on=["key1", "key2"], how="outer")

  key1 key2  left_data_x  left_data_y
0   SF  one         10.0         40.0
1   SF  one         10.0         50.0
2   SF  two         20.0          NaN
3   LA  one         30.0         60.0
4   LA  two          NaN         70.0

In [79]:
pd.merge(df_left,df_right, on = "key1")

  key1 key2_x  left_data_x key2_y  left_data_y
0   SF    one           10    one           40
1   SF    one           10    one           50
2   SF    two           20    one           40
3   SF    two           20    one           50
4   LA    one           30    one           60
5   LA    one           30    two           70

In [80]:
pd.merge(df_left,df_right, on = "key1", suffixes=["_left", "_right"])

  key1 key2_left  left_data_left key2_right  left_data_right
0   SF       one              10        one               40
1   SF       one              10        one               50
2   SF       two              20        one               40
3   SF       two              20        one               50
4   LA       one              30        one               60
5   LA       one              30        two               70

In [81]:
from pandas import DataFrame

In [83]:
dframe1 = DataFrame({"key":["X","Z","Y","Z","X","X"], "data_set_1":np.arange(6)})

In [84]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [85]:
dframe2 = DataFrame({"key":["Q","Y","Z"], "data_set_2":[1,2,3]})

In [86]:
dframe2

  key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [87]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [88]:
pd.merge(dframe1,dframe2, on="key")

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [89]:
pd.merge(dframe1,dframe2, on="key", how="left")

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         3.0
2   Y           2         2.0
3   Z           3         3.0
4   X           4         NaN
5   X           5         NaN

In [90]:
pd.merge(dframe1,dframe2, on="key", how="right")

  key  data_set_1  data_set_2
0   Z         1.0           3
1   Z         3.0           3
2   Y         2.0           2
3   Q         NaN           1

In [91]:
pd.merge(dframe1,dframe2, on="key", how="outer")

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         3.0
4   Z         3.0         3.0
5   Y         2.0         2.0
6   Q         NaN         1.0

In [93]:
df_left = DataFrame({"key":["X","Y","Z","X","Y"],
                   "data":range(5)})

In [95]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [98]:
df_right = DataFrame({"group_data":[10,20]},index=["X","Y"])

In [99]:
df_right

   group_data
X          10
Y          20

In [100]:
pd.merge(df_left,df_right, left_on="key", right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [101]:
pd.merge(df_left,df_right, left_on="key", right_index=True,how="outer")

  key  data  group_data
0   X     0        10.0
3   X     3        10.0
1   Y     1        20.0
4   Y     4        20.0
2   Z     2         NaN

In [102]:
df_left_hr = DataFrame({"key1":["SF", "SF", "SF","LA", "LA"],
                       "key2":[10,20,30,20,30],
                       "data_set":np.arange(5)})

In [104]:
df_left_hr

  key1  key2  data_set
0   SF    10         0
1   SF    20         1
2   SF    30         2
3   LA    20         3
4   LA    30         4

In [105]:
df_right_hr = DataFrame(np.arange(10).reshape((5,2)),
                       index=[["LA","LA","SF","SF","SF"],
                             [20,10,10,10,20]],
                       columns=["col_1", "col_2"])

In [106]:
df_right_hr

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [107]:
pd.merge(df_left_hr,df_right_hr, left_on=["key1", "key2"], right_index=True)

  key1  key2  data_set  col_1  col_2
0   SF    10         0      4      5
0   SF    10         0      6      7
1   SF    20         1      8      9
3   LA    20         3      0      1

In [108]:
df_left.join(df_right)

  key  data  group_data
0   X     0         NaN
1   Y     1         NaN
2   Z     2         NaN
3   X     3         NaN
4   Y     4         NaN

In [109]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [110]:
df_right

   group_data
X          10
Y          20

In [111]:
df_right

   group_data
X          10
Y          20